Revit 2027 API
IPointCloudEngine.CreatePointCloudAccess Method
 Implement this method to construct the IPointCloudAccess interface for the point cloud designated by the identifier. This method is called once during the creation of a PointCloudType.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
IPointCloudAccess CreatePointCloudAccess(
	string identifier
)
Function CreatePointCloudAccess (
	identifier As String
) As IPointCloudAccess
IPointCloudAccess^ CreatePointCloudAccess(
	String^ identifier
)
abstract CreatePointCloudAccess :
        identifier : string -> IPointCloudAccess
Parameters
identifier String
 An identifier unique to the point cloud. This will be a file name if the engine was registered as file-based, or an arbitrary identifier if the engine is not file-based.
Return Value
IPointCloudAccess
 The object that can be used to create iterators and interrogate the point cloud for its features.
Remarks
 The instance of the returned IPointCloudAccess is then used by Revit to display instances of the point cloud in Revit graphics and in the user interface.
See Also
Reference
IPointCloudEngine Interface
Autodesk.Revit.DB.PointClouds Namespace